Revit 2027 API
UIDocument.GetRevitUIFamilyLoadOptions Method
Return the option object that allows you to use Revit's dialog boxes to let the user respond to questions that arise during loading of families.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFamilyLoadOptions GetRevitUIFamilyLoadOptions()
Public Shared Function GetRevitUIFamilyLoadOptions As IFamilyLoadOptions
public:
static IFamilyLoadOptions^ GetRevitUIFamilyLoadOptions()
static member GetRevitUIFamilyLoadOptions : unit -> IFamilyLoadOptions
Return Value
IFamilyLoadOptions
Exceptions
Exception | Condition
InvalidOperationException | Thrown if this API method is invoked in UI less mode
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace